# Load Combination State Enumeration

Source: https://www.revitapidocs.com/2026/e996d993-abe2-a1f8-a722-aedf6e95cf4a.htm

---

| Load Combination State Enumeration |
| --- |

Specifies load combination state.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum LoadCombinationState
```

```
Public Enumeration LoadCombinationState
```

```
public enum class LoadCombinationState
```

```
type LoadCombinationState
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Accidental | 5 | Accidental |
| Serviceability | 0 | Serviceability |
| ServiceabilityFrequent | 3 | Serviceability Frequent |
| ServiceabilityQuasiPermanent | 2 | Serviceability Quasi\-permanent |
| ServiceabilityRare | 4 | Serviceability Rare |
| Special | 6 | Special |
| Ultimate | 1 | Ultimate |

See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace